{
    "id": "camp_sign",
    "title": "Your Summer Camp sign",
    "short_title": "Camp Sign",
    "description": "Welcome to your first day! Before you set out from the lodge, your campsite sign needs a design. Be creative! Use a crazy color scheme, or show what you want to do at camp.  \nIn the Pacific Northwest of the United States, indigenous peoples carved Totem Poles to tell the stories of their families and cultures. These beautiful sculptures are carved into trees and often feature characters and events from legends. You can search the internet for images of Totem Poles for inspiration.",
    "icon_class": "challenge_campsign",
    "cover": "summercamp/day_1.png",
    "completion_text": "Well done! Now give your camp its own name and style. Change your camp name on line 18, or the color of the sign on line 3... why not add a nice background and some extra decorations? All those tool icons on the left can help you get started.",
    "difficulty": 1,
    "startAt": 0,
    "summerCamp": true,
    "rewards": null,
    "steps": [
        {
            "hint": "It's a sunny day! Set the background color to blue - **type** `background blue`",
            "solution": "background blue"
        },
        {
            "hint": "Let's move the cursor over to the place on the screen where we want to start drawing our sign.\n\nPress ENTER to add the next instruction, and  - **type** `moveTo 100, 150`",
            "solution": "moveTo 100, 150"
        },
        {
            "hint": "In Make Art we draw shapes using digital pens. Before we draw the next shape, we need to choose the pen we want to use to fill the inside of the shape. Let's select a brown pen by setting the color to lightbrown.\n\n In a new line **type** `color lightbrown`",
            "solution": "color lightbrown"
        },
        {
            "hint": "When we draw a shape we can control how thick the line is that the pen leaves behind on the outside of the shape. This line is called the **stroke**.\n\n  Press enter and then set the stroke to 0, to avoid drawing lines - **type** `stroke 0`",
            "solution": "stroke 0"
        },
        {
            "hint": "Now that we have our pen all set up, we can get started on the sign!\n\nDraw the main billboard with a rectangle - **type** `rectangle 300, 200`",
            "solution": "rectangle 300, 200"
        },
        {
            "hint": "Let's draw a shadow. Set the color to brown first - **type** `color brown`",
            "solution": "color brown"
        },
        {
            "hint": "Draw a thin shadow with a rectangle - **type** `rectangle 300, 5`",
            "solution": "rectangle 300, 5"
        },
        {
            "hint": "That sign looks too clean. We need to draw some imperfections.\n\nMove the cursor to place one on the left side of the sign- **type** `moveTo 100, 220`",
            "solution": "moveTo 100, 220"
        },
        {
            "hint": "Our imperfection will be a triangle. First we need to set the `color` to `blue` to match the background.",
            "solution": "color blue"
        },
        {
            "hint": "Set the stroke to be size 5 and brown (to match the sign). You can do both these things in one command - **type** `stroke brown, 5`",
            "solution": "stroke brown, 5"
        },
        {
            "hint": "Now we will use the `polygon` command to draw a triangular imperfection. To create it, we need to list out the positions of the two other corners - **type** `polygon 16, 10, 0, 11`",
            "solution": "polygon 16, 10, 0, 11"
        },
        {
            "hint": "The sign needs a post. Move the cursor to where we will draw it - **type** `moveTo 230, 350`",
            "solution": "moveTo 230, 350"
        },
        {
            "hint": "Set the color of the post to brown - **type** `color brown` ",
            "solution": "color brown"
        },
        {
            "hint": "Set the stroke to 0, again - **type** `stroke 0`",
            "solution": "stroke 0"
        },
        {
            "hint": "Now that we have the colors sorted, draw the post with a rectangle - **type** `rectangle 40, 150`",
            "solution": "rectangle 40, 150"
        },
        {
            "hint": "We need some text in that sign. Move the cursor to place the text - **type** `moveTo 250, 270`",
            "solution": "moveTo 250, 270"
        },
        {
            "hint": "Next we need to choose our font. There are lots to choose from, like `Bariol`, `Georgia`, `Comic Sans MS`, `cursive`, and `Courier`.\n\nPick your favorite and type it in (inside of quote marks) like this - `font 'Bariol', 70`.",
            "solution": "font 'Bariol', 70"
        },
        {
            "hint": "Now write some silly text - **type** `text 'My Camp'`",
            "solution": "text 'My Camp'"
        }
    ]
}
