{
    "id": "pong",
    "title": "Pong",
    "description": "Programa una partida de Ping Pong",
    "code": "",
    "startAt": 2,
    "steps": [
        {
            "hint": "Pong (1972) fue una de las primeras consolas de videojuegos domésticas. Es un increíblemente básico juego de tenis de mesa. Y ¿qué necesitamos para jugar tenis de mesa? Primero, una pelota. Usaremos los comandos en inglés. Círculo se dice circle **escribe** `circle 15`",
            "solution": "circle 15"
        },
        {
            "hint": "Luego necesitamos dibujar las raquetas. Usamos la función moveTo, que significa mover a, para ubicar objetos. El primer número después de moveTo dice la posición horizontal del objeto (izquiera y derecha). El segundo número, dice la posición vertical (arriba y abajo).  **escribe** `moveTo 30,100`",
            "solution": "moveTo 30,100"
        },
        {
            "hint": "Dibujaremos la primera raqueta usando la función del rectángulo. Rectángulo se dice rectangle **escribe** `rectangle 20, 100`",
            "solution": "rectangle 20, 100"
        },
        {
            "hint": "No es divertido jugar Pong sin un oponente **escribe** `moveTo 450,300`",
            "solution": "moveTo 450,300"
        },
        {
            "hint": "Finalmente, dibujemos la raqueta del oponente, el primer número es el ancho, y el segundo la altura. **escribe** `rectangle 20, 100`",
            "solution": "rectangle 20, 100"
        }
    ],
    "completion_text": "¡Bien hecho! Has recreado uno de los primeros videojuegos de la historia, bastante aburrido de mirar ¿no? ¿Por qué no intentas hacer click en el número 100 de la primera función moveTo? y utilizar el control deslizante para reposicionar la raqueta?",
    "gallery": {
        "cover_path": "/assets/challenges/images/pixelremixes/",
        "remixes": [
            "pong-white.png",
            "pong-movecolor.png",
            "pong-movepaddles.png"
        ]
    },
    "cover": "pixel-pong.png",
    "guide": "#### Nuevas palabras\n**circle** radius | circle 15\n\nDibuja un círculo en la posición actual del cursor. Cuánto más grande el número de radio que ingreses, más grande será el círculo: el radio es la distancia desde el centro del círculo al borde.\n\n**moveTo** x, y | moveTo 30, 100\n\nMueve la posición de dibujo al nuevo lugar que asignes en X, Y. El primer valor es el valor de la coordenada X, la cual controla la ubicación en el eje horizontal. El segundo valor es la coordenada Y, la cual controla la ubicación en el eje vertical.\n\n**rectangle** width, height | rectangle 20, 100\n\nDibuja un rectángulo en la posición actual del cursor. La anchura y la altura controlan independientemente cuán ancho y cuán alto será el rectángulo.\n\n**color** name | color red\n\nCambia el color de dibujo. Las siguientes figuras y texto serán dibujados con el color que configures hasta cambiarlo nuevamente. Para configurarlo a transparente escribe `color null`\n\n**background** colorName | background white\n\nCambia el color del fondo.\n\n#### Lo que crearás\n1. Pong (1972) fue una de las primeras consolas de videojuegos. Es un increíblemente básico juego de tenis de mesa. Y ¿qué necesitamos para jugar tenis de mesa? Primero, una pelota. Usaremos los comandos en inglés. Círculo se dice circle **Escribe** `circle 15`\n2. Luego necesitamos dibujar las raqueta. Usamos la función moveTo para ubicar objetos. El primer número después de moveTo dice la posición horizontal del objeto (izquiera y derecha). El segundo número, dice la posición vertical (arriba y abajo).  **escribe** `moveTo 30,100`\n3. Dibujaremos la primera raqueta usando la función del rectángulo. Rectángulo se dice rectangle **escribe** `rectangle 20, 100`\n4. No es divertido jugar Pong sin un oponente **escribe** `moveTo 450,300`\n5. Finalmente, dibujemos la raqueta del oponente, el primer número es el ancho, y el segundo la altura. **escribe** `rectangle 20, 100`\n\n#### Lo que hackearás\nExiste una función especial que todo artista de programación debería conocer: el color. El color predeterminado siempre será el negro y cada vez que una figura sea dibujada en Hacer Arte, la función de dibujo comprueba qué color se debe utilizar. Entonces, como no has especificado un color, todo será dibujado de color negro.\n\nPuedes cambiar el color a rojo, por ejemplo, escribiendo color red luego del primer comando `moveTo` y antes del comando `rectangle 20, 100`para cambiar el color de ambas raquetas. Nota: esto solamente afectará a las figuras dibujadas luego de este comando, por eso escribirlo al principio del desafío no hará nada. \n\nEl color del fondo puede ser modificado con background charcoal. Puedes poner esto en cualquier parte del código, y para la mayoría de creaciones sólo lo ingresarás una vez. Es mejor ponerlo al comienzo, antes de cualquier código.\n\nFinalmente, puedes cambiar la posición de las raquetas hacia arriba y hacia abajo cambiando el segundo número al lado de la función moveTo. Puedes hacer click en el número y jugar con la posición usando el control deslizante para cambiar el número.\n\n#### Informe\nEn 1972, Al Alcorn recibió un ejercicio de calentamiento en su nuevo empleo en la compañía Atari, y nació Ping Pong: dos raquetas, una pelota, y poco después, cola de gente a la vuelta de la esquina para comenzar a jugarlo. Ping Pong se convirtió en una sensación a nivel internacional, vendiendo millones de copias. Fue tan famoso, que docenas de imitaciones fueron creadas por competidores que intentaban aprovecharse del éxito de la compañía Atari. Lo que lo hizo tan simple y universal terminó por convertirlo en fácil de copiar. \n\nTu primera tarea como hacker es crear tu propia versión de Pong. Uno de los secretos de un gran hacker es mezclar ideas de otros lugares para crear algo nuevo. ¡Puedes tomar la idea original de Pong y hackearla para crear tu propio juego! Crearás un escenario básico de dos raquetas y una pelota. Luego, ¡depende de ti hackearlo para crear algo nuevo! \n"
}
