{
    "id": "ship",
    "title": "Asteroides",
    "description": "Programa una nave espacial de vectores usando líneas",
    "code": "",
    "startAt": 2,
    "steps": [
        {
            "hint": "Asteroides (1979) fue uno de los primeros videojuegos de arcade importantes. Está situado en el espacio, por eso vamos a tener que establecer el escenario **escribe** `background black`",
            "solution": "background black"
        },
        {
            "hint": "Los gráficos en Asteroides eran líneas simples denominadas vectores. Hoy en día, aún se utiliza una versión más compleja de este concepto en los gráficos de las computadoras. Primero necesitamos configurar el tamaño del trazo y su color **escribe** `stroke white,5`",
            "solution": "stroke white,5"
        },
        {
            "hint": "Luego usamos la función move para configurar el punto de partida de nuestra primera línea de la nave. **escribe** `move 0, -70`",
            "solution": "move 0, -70"
        },
        {
            "hint": "'Función' es la palabra que utlizamos para definir lo que estamos dibujando. Dibujemos una línea que empiece justo donde movimos el cursor y termine abajo a la izquierda. Primero esribimos la función (line) y luego dónde queremos que empiece y termine la línea **escribe** `line -50,150` Intenta cambiar el valor de Y, de 150 a -150 y fíjate lo que sucede. ¡La línea va hacia arriba! ¡Mejor, muévela nuevamente a 150!",
            "solution": "line -50,150"
        },
        {
            "hint": "Para mover el cursor al punto donde queremos que nazca la próxima línea **escribe** `move -50,150`",
            "solution": "move -50,150"
        },
        {
            "hint": "Dibujamos una línea hacia adentro y hacia afuera para crear el propulsor de nuestra nave - **escribe** `line 50,-25`",
            "solution": "line 50,-25"
        },
        {
            "hint": "Muévete a las mismas coordenadas para continuar la línea en otra dirección **escribe** `move 50,-25`",
            "solution": "move 50,-25"
        },
        {
            "hint": "Replicamos la forma para dibujar el lado derecho de la nave dando vuelta la segunda coordenada de la línea anterior para dibujar hacia abajo en vez de hacia arriba **escribe** `line 50,25`",
            "solution": "line 50,25"
        },
        {
            "hint": "Muévete al extremo de esa línea **escribe** `move 50,25`",
            "solution": "move 50,25"
        },
        {
            "hint": "Nuestra nave comienza a tener forma. Para hacer una línea que conecte el extremo de abajo con el de arriba **escribe** `line -50,-150`",
            "solution": "line -50,-150"
        },
        {
            "hint": "Finalmente volvemos al punto de partida para darle un toque final **escribe** `move -50,-150`",
            "solution": "move -50,-150"
        },
        {
            "hint": "Dibujamos una línea que atraviese el centro para que esta simple figura se parezca más a una nave, los primeros videojuegos contaban sólo con una parte del gran poder informático con el que contamos hoy, por eso los gráficos tenían que ser muy básicos. **Escribe** `line 0,125`",
            "solution": "line 0,125"
        }
    ],
    "completion_text": "Tal vez no es gran cosa pero los gráficos simples de los primeros videojuegos, sentaron las bases para los gráficos 3D que se usan hoy en día.",
    "gallery": {
        "cover_path": "/assets/challenges/images/pixelremixes/",
        "remixes": [
            "ship-golden.png",
            "ship-thrust.png",
            "ship-sleek.png"
        ]
    },
    "cover": "pixel-ship.png",
    "guide": "#### Nuevas palabras\n**move** x, y | move 50, 25\n\nMueve el cursor de dibujo desde la posición actual hacia la cual indiques en los números X e Y. La diferencia con moveTo es que la última es relativa, no absoluta. `move 50, 25` moverá el cursor 50 hacia la derecha y 25 hacia abajo desde la posición actual. El primer valor es el valor de la coordenada X, la cual controla la ubicación en el eje horizontal. El segundo valor es la coordenada Y, la cual controla la ubicación en el eje vertical. Los valores negativos los ubicarán en las direcciones opuestas (izquierda y arriba).\n\n**line** x, y | line 50, 25\n\nDibuja una línea desde la posición actual hasta la que se indique. Las coordenadas X, Y controlan el punto relativo hasta el cual se dibujará la línea.\n\n**stroke** color, width | stroke white, 5\n\nConfigura el trazo del dibujo. Las siguientes figuras y el texto serán dibujados con el color y el ancho del trazo que configures hasta cambiarlo nuevamente. Esta función es inteligente y puede aceptar el color o el tamaño en cualquier orden, o uno por vez.\n\n#### Lo que crearás\n1.Asteroides (1979) fue uno de los primeros videojuegos de arcade importantes. Está situado en el espacio, por eso vamos a tener que establecer el escenario **escribe** `background black`\n2. Los gráficos en Asteroides eran líneas simples denominadas vectores. Hoy en día, aún se utiliza una versión más compleja de este concepto en los gráficos de las computadoras. Primero necesitamos configurar el tamaño del trazo y su color **escribe** `stroke white,5`\n3. Luego usamos la función move para configurar el punto de partida de nuestra primera línea de la nave. **escribe** `move 0, -70`\n4. Utilizamos la función line para dibujar una línea relativa al punto de partida, utilizamos un número negativo para que vaya hacia la izquierda y luego un número positivo para que vaya hacia abajo **escribe** `line -50,150`\n5. Para mover el cursor al punto donde queremos que nazca la próxima línea **escribe** `move -50,150`\n6. Dibujamos una línea hacia adentro y hacia afuera para crear el propulsor de nuestra nave - **escribe** `line 50,-25`\n7. Muévete a las siguientes coordenadas para continuar la línea en otra dirección **escribe** `move 50,-25`\n8. Replicamos la forma para dibujar el lado derecho de la nave dando vuelta la segunda coordenada de la línea anterior para dibujar hacia abajo en vez de hacia arriba **escribe** `line 50,25`\n9. Muévete al extremo de esa línea **escribe** `move 50,25`\n10. Nuestra nave comienza a tener forma. Para hacer una línea que conecte el extremo de abajo con el de arriba **escribe** `line -50,-150`\n11. Finalmente volvemos al punto de partida para darle un toque final **escribe** `move -50,-150`\n12. Dibujamos una línea que atraviese el centro para que esta simple figura se parezca más a una nave, los primeros videojuegos contaban sólo con una parte del gran poder informático con el que contamos hoy, por eso los gráficos tenían que ser muy básicos. **Escribe** `line 0,125`\n\n#### Lo que hackearás\nTal vez no sean gran cosa pero los gráficos simples de los primeros videojuegos, sentaron las bases para los gráficos 3D que se utilizan hoy en día. Puedes transformar tu nave configurando el color y el ancho del trazo. \n\nPara algo más avanzado, intenta dibujar más líneas.\n\n#### Informe\nAsteroides (1979) fue uno de los primeros videojuegos de arcade importantes. Limitados por hardware primitivo, los diseñadores del juego únicamente podían utilizar líneas simples basadas en gráficos llamadas vectores, hoy en día se utiliza una versión más compleja de este concepto en los gráficos de computadora.\n"
}
